#Дано 2 списка: ключи и значения. Создать из них словарь.

keys = ['бро','надо']
values = ['тебе','тренироваться']
keys_values = dict(zip(keys, values))
print(keys_values)
